app/controllers/static_pages_controller.rb

SELECT  "posts".* FROM "posts"   ORDER BY "posts"."created_at" DESC LIMIT 2
---
  def welcome
    @posts = Post.order(created_at: :desc).limit(2)